In [7]:
import pandas as pd

In [8]:
#series de pandas
numeros= [1,2,3,4,5,6,7,8,9,10]
series= pd.Series(numeros)
series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [9]:
data =  {
    "nombre": ["Ana", "Pedro", "Luis"],
      "edad": [21, 22, 23] ,
      "ciudad": ["Lima", "Arequipa", "Trujillo"]
      }
print(data), type(data)

{'nombre': ['Ana', 'Pedro', 'Luis'], 'edad': [21, 22, 23], 'ciudad': ['Lima', 'Arequipa', 'Trujillo']}

(None, dict)

In [10]:
#Generar DataFrame
df = pd.DataFrame(data)
df

  nombre  edad    ciudad
0    Ana    21      Lima
1  Pedro    22  Arequipa
2   Luis    23  Trujillo

In [ ]:
#exportar DATA FRAME
df.to_csv("data.csv")

In [14]:
#importar DATA FRAME
import_df = pd.read_csv("data.csv", index_col=0)
import_df.head()

  nombre  edad    ciudad
0    Ana    21      Lima
1  Pedro    22  Arequipa
2   Luis    23  Trujillo

In [20]:
#SELECIONAR UNA COLUMNA
import_df["nombre"]

0      Ana
1    Pedro
2     Luis
Name: nombre, dtype: object

In [23]:
df[["nombre", "ciudad","edad"]]

  nombre    ciudad  edad
0    Ana      Lima    21
1  Pedro  Arequipa    22
2   Luis  Trujillo    23

In [36]:
fila = df.loc[0]
fila

nombre     Ana
edad        21
ciudad    Lima
Name: 0, dtype: object

In [51]:
df[(df["edad"] >= 20) & (df["edad"] < 22)]

  nombre  edad ciudad
0    Ana    21   Lima

In [77]:
#33.50
filtro= (df["ciudad"].str.lower().str.startswith("t"))
print(df)
print("-----------------")
print(filtro)

  nombre  edad    ciudad
0    Ana    21      Lima
1  Pedro    22  Arequipa
2   Luis    23  Trujillo
-----------------
0    False
1    False
2     True
Name: ciudad, dtype: bool